Config/InformationRegisters/СоответствиеКПСКОСГУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеКПСКОСГУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКБК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АналитическийКодДохода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасхода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КОСГУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ВидыКБК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыКБК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>гКБК</Name>
					<Comment>Глава по БК</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КРБ</Name>
					<Comment>Классификация расходов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КДБ</Name>
					<Comment>Классификация доходов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КИФ</Name>
					<Comment>Классификация источников финансирования дефицита бюджетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АУИБУ</Name>
					<Comment>Для АУ и БУ начиная с 01.01.2017</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/InformationRegisters/СоответствиеКПСКОСГУ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьНастройкиПоДоходам(Очищать = Истина) Экспорт
	
	Регистр = РегистрыСведений.СоответствиеКПСКОСГУ.СоздатьНаборЗаписей();
	Регистр.Отбор.ТипДанных.Установить(ПредопределенноеЗначение("Перечисление.ВидыКБК.КДБ"));
	Регистр.Прочитать();
	
	ТабИсходная = Регистр.ВыгрузитьКолонки();
	Макет = ПолучитьМакет("Доходы");
	ОбластьКодДохода	= Макет.ПолучитьОбласть("КодДохода");
	ОбластьКОСГУ		= Макет.ПолучитьОбласть("КОСГУ");
	н = 0;
	Пока (Истина) Цикл
		н = н + 1;
		ТекКод = СокрЛП(ОбластьКодДохода.Область(н, 1).Текст);
		Если НЕ ЗначениеЗаполнено(ТекКод) Тогда
			Прервать;
		КонецЕсли;
		ТекКОСГУ = СокрЛП(ОбластьКОСГУ.Область(н, 1).Текст);
		Если НЕ ЗначениеЗаполнено(ТекКОСГУ) ИЛИ ТекКОСГУ = "000" Тогда
			Продолжить;
		КонецЕсли;
		ТекКод = СтрЗаменить(ТекКод, " ", "");
		Если НЕ СтрДлина(ТекКод) = 17 Тогда
			Продолжить;
		КонецЕсли;	
		МассивКОСГУ = СтрРазделить(СтрЗаменить(ТекКОСГУ, " ", ""), ",", Ложь);
		Для Каждого ЗнКОСГУ Из МассивКОСГУ Цикл
			Стр = ТабИсходная.Добавить();
			Стр.ТипДанных = ПредопределенноеЗначение("Перечисление.ВидыКБК.КДБ");
			Стр.ВидДохода = Лев(ТекКод, 10);
			Стр.АналитическийКодДохода = Прав(ТекКод, 3);
			Стр.КОСГУ = ЗнКОСГУ;
		КонецЦикла;
	КонецЦикла;
	ТабИсходная.Свернуть("ТипДанных,ВидДохода,АналитическийКодДохода,КОСГУ"); 
	
	Если Очищать Тогда
		Регистр.Очистить();
	КонецЕсли;	
	ТаблицаСоответствия = Регистр.Выгрузить();
	
	Для Каждого Стр Из ТабИсходная Цикл
		
		Строки = ТаблицаСоответствия.НайтиСтроки(Новый Структура("ТипДанных,ВидДохода,АналитическийКодДохода,КОСГУ", 
		Стр.ТипДанных, Стр.ВидДохода, Стр.АналитическийКодДохода, Стр.КОСГУ));
		Если Строки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаСоответствия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
	Регистр.Загрузить(ТаблицаСоответствия);
	Регистр.Записать();
	
КонецПроцедуры	

Процедура ЗагрузитьНастройкиПоРасходам(Очищать = Истина) Экспорт
	
	Регистр = РегистрыСведений.СоответствиеКПСКОСГУ.СоздатьНаборЗаписей();
	Регистр.Отбор.ТипДанных.Установить(ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ"));
	Регистр.Прочитать();
	
	ТабИсходная = Регистр.ВыгрузитьКолонки();
	Макет = Обработки.АудитСостоянияСистемыБГУ.ПолучитьМакет("СоответствиеВидовРасходовКРБиКОСГУ");
	н = 1;
	Пока (Истина) Цикл
		н = н + 1;
		ТекКод = СокрЛП(Макет.Область("R" + Строка(н) + "C1:R" + Строка(н) + "C1").Текст);
		Если НЕ ЗначениеЗаполнено(ТекКод) Тогда
			Прервать;
		КонецЕсли;
		ТекКОСГУ = СокрЛП(Макет.Область("R" + Строка(н) + "C2:R" + Строка(н) + "C2").Текст);
		Если НЕ ЗначениеЗаполнено(ТекКОСГУ) ИЛИ ТекКОСГУ = "000" Тогда
			Продолжить;
		КонецЕсли;
		ТекКод = СтрЗаменить(ТекКод, " ", "");
		Если НЕ СтрДлина(ТекКод) = 3 Тогда
			Продолжить;
		КонецЕсли;	
		МассивКОСГУ = СтрРазделить(СтрЗаменить(ТекКОСГУ, " ", ""), ",", Ложь);
		Для Каждого ЗнКОСГУ Из МассивКОСГУ Цикл
			Стр = ТабИсходная.Добавить();
			Стр.ТипДанных = ПредопределенноеЗначение("Перечисление.ВидыКБК.КРБ");
			Стр.ВидРасхода = ТекКод;
			Стр.КОСГУ = ЗнКОСГУ;
		КонецЦикла;
	КонецЦикла;
	ТабИсходная.Свернуть("ТипДанных,ВидРасхода,КОСГУ"); 
	
	Если Очищать Тогда
		Регистр.Очистить();
	КонецЕсли;	
	ТаблицаСоответствия = Регистр.Выгрузить();
	
	Для Каждого Стр Из ТабИсходная Цикл
		
		Строки = ТаблицаСоответствия.НайтиСтроки(Новый Структура("ТипДанных,ВидРасхода,КОСГУ", 
		Стр.ТипДанных, Стр.ВидРасхода, Стр.КОСГУ));
		Если Строки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаСоответствия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
	Регистр.Загрузить(ТаблицаСоответствия);
	Регистр.Записать();
	
КонецПроцедуры	


#КонецОбласти
 
#КонецЕсли
